
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.5. 云服务简介与科学上网 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="two_chrome_plugins.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.xiaobotalk.com" target="_blank" class="custom-link">我的个人网站</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    一: Mac 基础介绍和基本技巧篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../PartOne/one_mac_tips.html">
            
                <a href="../PartOne/one_mac_tips.html">
            
                    
                    1.1. Mac 基础操作实用小技巧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../PartOne/one_mac_iphone.html">
            
                <a href="../PartOne/one_mac_iphone.html">
            
                    
                    1.2. Mac 与 iPhone 互联
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../PartOne/one_mac_selfSoftware.html">
            
                <a href="../PartOne/one_mac_selfSoftware.html">
            
                    
                    1.3. 你可能会用到的 Mac 自带软件
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    二: Mac 常见问题与佳软推荐篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="two_outer_disk.html">
            
                <a href="two_outer_disk.html">
            
                    
                    2.1. Mac 外接磁盘写入问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="two_Payme.html">
            
                <a href="two_Payme.html">
            
                    
                    选择性付费阅读
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="two_Alfred.html">
            
                <a href="two_Alfred.html">
            
                    
                    2.2. Mac 第一神软 Alfred
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="two_markdown.html">
            
                <a href="two_markdown.html">
            
                    
                    2.3. Markdown 高级技巧与写作软件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.5" data-path="two_chrome_plugins.html">
            
                <a href="two_chrome_plugins.html">
            
                    
                    2.4. Chrome 插件推荐
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.6" data-path="Two_science_internet.html">
            
                <a href="Two_science_internet.html">
            
                    
                    2.5. 云服务简介与科学上网
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" >
            
                <span>
            
                    
                    三: Mac 进阶和程序员折腾篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="../PartThree/three_mac_terminal.html">
            
                <a href="../PartThree/three_mac_terminal.html">
            
                    
                    3.1. Mac Terminal 相关配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="../PartThree/three_mac_shell.html">
            
                <a href="../PartThree/three_mac_shell.html">
            
                    
                    3.2. Shell 常用指令与 Mac 特有的命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.3" data-path="../PartThree/three_mac_charles.html">
            
                <a href="../PartThree/three_mac_charles.html">
            
                    
                    3.3. Charles 抓取网络请求
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.4" data-path="../PartThree/three_mac_git.html">
            
                <a href="../PartThree/three_mac_git.html">
            
                    
                    3.4. 轻度编程从 Git 开始
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2.5. 云服务简介与科学上网</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E91;&#x670D;&#x52A1;&#x7B80;&#x4ECB;&#x4E0E;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;">&#x4E91;&#x670D;&#x52A1;&#x7B80;&#x4ECB;&#x4E0E;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;</h2>
<p style="text-align:center"><img src="http://img.xiaobotalk.cn/macSkills/vps_02.png" alt="vps"></p>

<p>&#x901A;&#x4FD7;&#x7684;&#x8BB2;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x53F0;&#x6216;&#x591A;&#x53F0;&#x5177;&#x6709;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x8D2D;&#x4E70;&#x4E00;&#x53F0;&#x5B9E;&#x4F53;&#x670D;&#x52A1;&#x5668;&#x5F80;&#x5F80;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x5E76;&#x4E14;&#x4E2A;&#x4EBA;&#x7F51;&#x7EDC;&#x76EE;&#x524D;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x63A5;&#x5165;&#x5230;&#x5E7F;&#x57DF;&#x7F51;&#x4E2D;&#xFF1B;&#x6240;&#x4EE5;&#x4E91;&#x670D;&#x52A1;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#xFF0C;&#x6709;&#x80FD;&#x529B;&#x7684;&#x516C;&#x53F8;&#x82B1;&#x94B1;&#x4E70;&#x4E00;&#x5806;&#x670D;&#x52A1;&#x5668;&#x653E;&#x5728;&#x673A;&#x623F;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x628A;&#x5B83;&#x4EEC;&#x5206;&#x533A;&#x79DF;&#x7ED9;&#x4E2A;&#x4EBA;&#x4F7F;&#x7528;&#x8005;&#x6216;&#x8005;&#x5C0F;&#x578B;&#x516C;&#x53F8;&#x4F7F;&#x7528;&#xFF1B;</p>
<p>&#x73B0;&#x5728;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x5E02;&#x573A;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x5E9E;&#x6742;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x8D77;&#x4E86;&#x5404;&#x79CD;&#x540D;&#x5B57;&#xFF0C;&#x8BA9;&#x4EBA;&#x773C;&#x82B1;&#x7F2D;&#x4E71;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x4E3B;&#x8981;&#x5C31;&#x770B;&#x5B83;&#x662F;<strong>&#x670D;&#x52A1;&#x5668;</strong>&#x8FD8;&#x662F;<strong>&#x4E3B;&#x673A;</strong>&#x3002;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#xFF0C;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x5C31;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8D77;&#x591A;&#x4E2A;&#x7AD9;&#x70B9;&#xFF0C;&#x518D;&#x5B89;&#x88C5;&#x4E2A; shadowsocks...&#x7B49;&#x7B49;&#xFF1B;&#x4E3B;&#x673A;&#x5219;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x7528;&#x7F51;&#x9875;&#x9762;&#x677F;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x529F;&#x80FD;&#x53D7;&#x9650;&#xFF0C;&#x4E00;&#x822C;&#x53EA;&#x80FD;&#x653E;&#x4E00;&#x4E2A;&#x7AD9;&#x70B9;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x6709;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5206;&#x4E3A;&#xFF1A;</p>
<ul>
<li>VPS &#x670D;&#x52A1;&#x5668;</li>
<li>&#x4E91;&#x670D;&#x52A1;&#x5668; ECS</li>
</ul>
<p>&#x4E3B;&#x673A;&#x5219;&#x4E3B;&#x8981;&#x662F;: </p>
<ul>
<li>&#x5171;&#x4EAB;(&#x72EC;&#x4EAB;)&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;</li>
</ul>
<h2 id="vps-&#x670D;&#x52A1;&#x5668;&#x53CA;&#x64CD;&#x4F5C;&#x7B80;&#x4ECB;">VPS &#x670D;&#x52A1;&#x5668;&#x53CA;&#x64CD;&#x4F5C;&#x7B80;&#x4ECB;</h2>
<hr style="height:1px">

<p>VPS &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x5F00;&#x653E;&#xFF0C;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x90FD;&#x9700;&#x8981;&#x79DF;&#x8D41;&#x8005;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x5B89;&#x88C5;&#x548C;&#x914D;&#x7F6E;&#xFF0C;&#x79DF;&#x4E00;&#x53F0;&#x65B0;&#x670D;&#x52A1;&#x5668;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x5B89;&#x88C5;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x4F1A;&#x5B89;&#x88C5; CentOS &#x6216;&#x8005; Ubuntu&#xFF0C;&#x4E24;&#x79CD;&#x90FD;&#x662F; Linux &#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x5B89;&#x88C5;&#x7CFB;&#x7EDF;&#x4E00;&#x822C;&#x662F;&#x5728;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x9875;&#x9762;&#x4E2D;&#x9009;&#x62E9;&#x5B89;&#x88C5;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x7528;&#x6237;&#x3001;&#x7BA1;&#x7406;&#x6743;&#x9650;&#x3001;&#x57FA;&#x7840;&#x7684;&#x8F6F;&#x4EF6;&#x73AF;&#x5883;&#x5B89;&#x88C5;&#x7B49;...&#x8981;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x767B;&#x5F55;&#x5230;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5173;&#x4E8E; SSH &#x767B;&#x5F55;&#xFF1B;</p>
<p>SSH &#x5373; Secure Shell&#xFF08;&#x5B89;&#x5168;&#x5916;&#x58F3;&#x534F;&#x8BAE;&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x52A0;&#x5BC6;&#x7684;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x901A;&#x8FC7; Secure Shell &#x4E2D;&#x7684; Shell &#x4FBF;&#x80FD;&#x731C;&#x6D4B;&#x5230;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x7EC8;&#x7AEF;&#x6765;&#x767B;&#x5F55;&#x7684;&#x4E00;&#x79CD;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;SSH &#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x95F4;&#x7684;&#x52A0;&#x5BC6;&#x767B;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4F7F;&#x7528; SSH &#x534F;&#x8BAE;&#x767B;&#x5F55;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x8FDC;&#x7A0B;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4EBA;&#x4E3A;&#x8FD9;&#x79CD;&#x767B;&#x5F55;&#x65B9;&#x5F0F;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x767B;&#x5F55;&#x6307;&#x4EE4;&#x4E5F;&#x5F88;&#x7B80;&#x5355;</p>
<pre><code>$ ssh user@host -p port
</code></pre><p>user &#x5C31;&#x662F; Linux &#x4E0A;&#x521B;&#x5EFA;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x4E00;&#x822C;&#x4F7F;&#x7528; root &#x7528;&#x6237;&#x3002;host &#x5373;&#x4E3B;&#x673A;&#x5730;&#x5740;(ip)&#xFF0C;&#x8FD8;&#x6709;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x4E00;&#x822C; ssh &#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#x662F; 22&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x8FC7; ssh &#x7684;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x5199; -p port&#x3002;</p>
<p>&#x63A8;&#x8350;&#x4E00;&#x4E2A; ssh &#x767B;&#x5F55;&#x7684;&#x7EC8;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF1A;Termius&#xFF0C;<a href="https://www.termius.com/" target="_blank">&#x5B98;&#x7F51;&#x5730;&#x5740;</a>&#x3002;&#x6BD4;&#x7CFB;&#x7EDF;&#x81EA;&#x5E26;&#x7684;&#x7EC8;&#x7AEF;&#x65B9;&#x4FBF;&#x4E00;&#x4E9B;&#xFF0C;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x505A; ssh &#x767B;&#x5F55;&#x3002;</p>
<h2 id="&#x4E91;&#x670D;&#x52A1;&#x5668;-ecs">&#x4E91;&#x670D;&#x52A1;&#x5668; ECS</h2>
<hr style="height:1px">

<p>&#x4E91;&#x670D;&#x52A1;&#x5668; ECS &#x6211;&#x4E2A;&#x4EBA;&#x8FD8;&#x6CA1;&#x4F7F;&#x7528;&#x8FC7;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ECE;&#x4ECB;&#x7ECD;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x66F4;&#x50CF;&#x4E00;&#x53F0;&#x5F39;&#x6027;&#x7684; VPS&#xFF0C;&#x6BD5;&#x7ADF;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x91CC;&#x6709;&#x4E2A; E (Elastic)&#x3002;&#x5176;&#x5BF9;&#x4E8E;&#x64CD;&#x4F5C;&#x8005;&#x7684;&#x5F00;&#x653E;&#x7A0B;&#x5EA6;&#x5F88;&#x5927;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x9644;&#x52A0;&#x7684;&#x670D;&#x52A1;&#x6765;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#xFF0C;&#x652F;&#x6301;&#x7EC8;&#x7AEF;&#x3001;&#x7BA1;&#x7406;&#x63A7;&#x5236;&#x53F0;&#x3001;Web &#x670D;&#x52A1;&#x9875;&#x9762;&#x3001;API(&#x770B;&#x5177;&#x4F53;&#x4F9B;&#x5E94;&#x5546;) &#x64CD;&#x4F5C;&#x4E3B;&#x673A;&#xFF0C;&#x5F39;&#x6027;&#x5219;&#x8868;&#x660E;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x968F;&#x65F6;&#x53D8;&#x66F4;&#xFF0C;&#x5305;&#x62EC;&#x8BA1;&#x7B97;&#x914D;&#x7F6E;&#x3001;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x3001;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x914D;&#x7F6E;&#xFF0C;&#x5C31;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#xFF0C;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x3002;</p>
<h2 id="&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x7B80;&#x4ECB;">&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x7B80;&#x4ECB;</h2>
<hr style="height:1px">

<p>&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x4ECE;&#x540D;&#x5B57;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x6863;&#x6B21;&#x964D;&#x4E0B;&#x6765;&#x4E86;&#xFF0C;&#x524D;&#x8FB9;&#x90FD;&#x53EB;<strong>&#x670D;&#x52A1;&#x5668;</strong>&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x80FD;&#x53EB;<strong>&#x4E3B;&#x673A;</strong>&#x4E86;&#xFF0C;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x80FD; ssh &#x8FDC;&#x7A0B;&#x767B;&#x5F55;&#xFF0C;&#x64CD;&#x4F5C;&#x90FD;&#x5728;&#x670D;&#x52A1;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x9875;&#x9762;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x540C;&#x65F6;&#x4E5F;&#x9884;&#x88C5;&#x4E86;&#x7F51;&#x7AD9;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x5C31;&#x548C;&#x6570;&#x636E;&#x5E93;&#x73AF;&#x5883;&#xFF1B;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x53C8;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5206;&#x4E3A; 2 &#x79CD;&#xFF1A;</p>
<ul>
<li>&#x5171;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;</li>
<li>&#x72EC;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;</li>
</ul>
<p>&#x7B80;&#x5355;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x6574;&#x79DF;&#x623F;&#x548C;&#x5408;&#x79DF;&#x623F;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p><strong>&#x963F;&#x91CC;&#x4E91;&#x5BF9;&#x5171;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x7684;&#x89E3;&#x91CA;</strong></p>
<p>&#x5171;&#x4EAB;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x5373;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x5212;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x4E00;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5206;&#x914D;&#x591A;&#x4E2A;&#x79DF;&#x6237;&#xFF0C;&#x8FD9;&#x4E9B;&#x79DF;&#x6237;&#x5171;&#x4EAB;&#x8FD9;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x6BCF;&#x4E2A;&#x7A7A;&#x95F4;&#x90FD;&#x7ED9;&#x4E88;&#x5355;&#x72EC;&#x7684; FTP &#x6743;&#x9650;&#x548C; Web &#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;</p>
<p><strong>&#x963F;&#x91CC;&#x4E91;&#x5BF9;&#x72EC;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x7684;&#x89E3;&#x91CA;</strong></p>
<p>&#x4E0E;&#x5171;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x76F8;&#x6BD4;&#xFF0C;&#x72EC;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x662F;&#x8D44;&#x6E90;&#x72EC;&#x4EAB;&#x3002;&#x4EAB;&#x6709;&#x6574;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8F6F;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#x6BCF;&#x53F0;&#x8F7B;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x7684; CPU&#x3001;&#x5185;&#x5B58;&#x3001;&#x5E26;&#x5BBD;&#x3001;&#x786C;&#x76D8;&#x5747;&#x4E3A;&#x72EC;&#x4EAB;&#xFF0C;&#x4E14;&#x4E0D;&#x9650;&#x6D41;&#x91CF;&#xFF0C;&#x5177;&#x6709;&#x72EC;&#x7ACB; IP&#xFF0C;&#x9884;&#x88C5;&#x4E86;&#x7F51;&#x7AD9;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x5C31;&#x548C;&#x6570;&#x636E;&#x5E93;&#x73AF;&#x5883;&#xFF0C;&#x540C;&#x65F6;&#x5177;&#x5907;&#x5171;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x548C;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x63D0;&#x4F9B;&#x53EF;&#x89C6;&#x5316;&#x64CD;&#x4F5C;&#x7684;&#x63A7;&#x5236;&#x9762;&#x677F;&#x73AF;&#x5883;&#xFF0C;&#x64CD;&#x4F5C;&#x7B80;&#x5355;&#xFF0C;&#x5373;&#x4E70;&#x5373;&#x7528;&#x3002;</p>
<p><strong>FTP &#x8F6F;&#x4EF6;</strong></p>
<p>&#x8981;&#x60F3;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x79CD;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x8FDB;&#x884C;&#x6587;&#x4EF6;&#x4EA4;&#x6362;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x8981;&#x901A;&#x8FC7; FTP &#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x3002;&#x5728;&#x672C;&#x5730;&#x5B89;&#x88C5;&#x4E00;&#x4E2A; FTP &#x8F6F;&#x4EF6;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x4E91;&#x865A;&#x673A;&#xFF0C;&#x8FDB;&#x884C;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x3001;&#x4E0B;&#x8F7D;&#x3001;&#x4FEE;&#x6539;&#x3002;Mac &#x4E0A;&#x7684; FTP &#x8F6F;&#x4EF6;&#xFF0C;&#x63A8;&#x8350; FileZilla&#xFF0C;&#x514D;&#x8D39;&#x597D;&#x7528;&#xFF0C;<a href="https://filezilla-project.org/download.php?platform=osx" target="_blank">&#x5B98;&#x7F51;&#x4E0B;&#x8F7D;&#x5730;&#x5740;</a>&#x3002;</p>
<p><strong>&#x9009;&#x62E9;&#x54EA;&#x79CD;&#x4E91;&#x670D;&#x52A1;</strong></p>
<p>&#x6240;&#x4EE5;&#x7EFC;&#x5408;&#x770B;&#x4E0B;&#x6765;&#xFF0C;&#x53EF;&#x64CD;&#x4F5C;&#x7A0B;&#x5EA6;&#x9AD8;&#xFF0C;&#x53C8;&#x6709;&#x4E0D;&#x9519;&#x7684;&#x72EC;&#x7ACB;&#x914D;&#x7F6E;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x662F; vps &#x548C;&#x4E91;&#x670D;&#x52A1;&#x5668; ECS (&#x8FDB;&#x5316;&#x7248; VPS)&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x540C;&#x7B49;&#x914D;&#x7F6E;&#x7684; ECS &#x5E94;&#x8BE5;&#x8981;&#x6BD4; VPS &#x5728;&#x4EF7;&#x683C;&#x4E0A;&#x8D35;&#x4E00;&#x4E9B;&#xFF0C;&#x6BD5;&#x7ADF;&#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x5C11;&#x65B9;&#x4FBF;&#x7684;&#x670D;&#x52A1;&#xFF1B;&#x6240;&#x4EE5;&#x4E2A;&#x4EBA;&#x5982;&#x679C;&#x60F3;&#x5B66;&#x4E60;&#x6216;&#x8005;&#x559C;&#x6B22;&#x6298;&#x817E;&#x670D;&#x52A1;&#x5668;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6700;&#x597D;&#x76F4;&#x63A5;&#x6765;&#x4E00;&#x53F0; VPS &#xFF0C;&#x4EF7;&#x683C;&#x4E5F;&#x4E0D;&#x8D35;&#xFF0C;&#x4E00;&#x5E74; 100 &#x591A;&#x5757;&#x7684;&#x4F9B;&#x5E94;&#x5546;&#x5F88;&#x591A;&#x3002;&#x5982;&#x679C;&#x662F;&#x4E2A;&#x4EBA;&#x5EFA;&#x7AD9;&#xFF0C;&#x4E13;&#x6CE8;&#x5185;&#x5BB9;&#xFF0C;&#x4E0D;&#x60F3;&#x6298;&#x817E;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x9009;&#x62E9;&#x72EC;&#x4EAB;&#x4E91;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x9884;&#x88C5;&#x4E86;&#x5F88;&#x591A;&#x5E94;&#x7528;&#x73AF;&#x5883;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x53BB;&#x5B89;&#x88C5;&#x4E86;&#x3002;</p>
<h2 id="&#x5728;-vps-&#x4E0A;&#x642D;&#x5EFA;-shadowsocks-&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;">&#x5728; VPS &#x4E0A;&#x642D;&#x5EFA; shadowsocks &#x670D;&#x52A1;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;</h2>
<hr style="height:1px">

<p>&#x5728;&#x56FD;&#x5185;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x7ED5;&#x4E0D;&#x5F00;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x79D1;&#x5B66;&#x4E0A;&#x7F51; VPN&#xFF0C;&#x65E0;&#x9650;&#x5236; Google &#xFF0C;&#x8BBF;&#x95EE; Youtube&#xFF0C;&#x4E0A; Twitter &#x7B49;&#x7B49;...&#x8FD9;&#x4E9B;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x65B9;&#x4FBF;&#xFF0C;&#x4F60;&#x61C2;&#x7684;&#x3002;</p>
<p>VPN &#x672C;&#x610F;&#x5E76;&#x4E0D;&#x662F;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x6307;&#x865A;&#x62DF;&#x7684;&#x4E2A;&#x4EBA;&#x7F51;&#x7EDC;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x56FD;&#x5185;&#x6162;&#x6162;&#x53D1;&#x5C55;&#x4E3A;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x4EBA;&#x4EEC;&#x4E5F;&#x5E38;&#x5E38;&#x5C06; VPN &#x548C;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x6DF7;&#x4E3A;&#x4E00;&#x8C08;&#x3002;&#x5173;&#x4E8E;&#x4EC0;&#x4E48;&#x662F;VPN&#xFF0C;&#x6211;&#x60F3;&#x5F15;&#x7528;&#x5728; Twitter &#x4E2D;&#x770B;&#x5230;&#x7684;&#x67D0;&#x5F20;&#x56FE;&#xFF0C;&#x4FB5;&#x6743;&#x5FC5;&#x5220;&#xFF1A;</p>
<p><img src="http://img.xiaobotalk.cn/macSkills/vps_07.JPG" alt="vpn&#x89E3;&#x91CA;" width="50%"></p>

<p>&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x5C31;&#x597D;&#x6BD4;&#xFF0C;&#x5728;&#x4F60;&#x7ECF;&#x5E38;&#x56DE;&#x5BB6;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6709;&#x5929;&#x7A81;&#x7136;&#x88AB;&#x4E00;&#x7FA4;&#x6709;&#x6B66;&#x88C5;&#x529B;&#x91CF;&#x7684;&#x8DEF;&#x9738;&#x662F;&#x62E6;&#x622A;&#x4E86;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4F60;&#x8D70;&#x8FD9;&#x6761;&#x8DEF;&#x4E86;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#x4F60;&#x53EA;&#x597D;&#x7ED5;&#x8DEF;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x8DEF;&#x90FD;&#x6CA1;&#x6709;&#x4FEE;&#x597D;&#xFF0C;&#x4F60;&#x53EA;&#x597D;&#x8054;&#x7CFB;&#x5176;&#x4ED6;&#x8DEF;&#x6865;&#x516C;&#x53F8;&#x4FEE;&#x5176;&#x4ED6;&#x7684;&#x8DEF;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x6761;&#x8DEF;&#x6709;&#x70B9;&#x7ED5;&#x3002;</p>
<p>&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#xFF0C;&#x4E3A;&#x4E86;&#x7701;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8D2D;&#x4E70;&#x4F9B;&#x5E94;&#x5546;&#x7684; VPN &#x670D;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#xFF1B;&#x5F53;&#x7136;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x79DF; VPS &#xFF0C;&#x81EA;&#x5DF1;&#x642D; Shadowsocks &#xFF0C;&#x6765;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#xFF1B;</p>
<p>&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x4EF7;&#x683C;&#x800C;&#x8A00;&#x5DEE;&#x4E0D;&#x592A;&#x591A;&#xFF0C;&#x4F46;&#x901A;&#x8FC7; VPS &#x642D; Shadowsocks &#x662F;&#x66F4;&#x4E3A;&#x63A8;&#x8350;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0D;&#x9650;&#x5236;&#x5BA2;&#x6237;&#x7AEF;&#x767B;&#x5F55;&#x6570;&#x91CF;(&#x56E0;&#x4E3A;&#x662F;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x7684;)&#xFF0C;&#x5982;&#x679C;&#x88AB;&#x5899;&#x4E86;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x6362; IP (&#x90E8;&#x5206; VPS &#x4F9B;&#x5E94;&#x5546;&#x63D0;&#x4F9B;&#x6B64;&#x670D;&#x52A1;)&#xFF0C;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x4F60;&#x7684; VPS &#x670D;&#x52A1;&#x5668;&#x8FD8;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x7528;&#x6765;&#x5E72;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x642D;&#x4E2A;&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#x3002;&#x8FD9;&#x6837;&#x770B;&#x6765; VPS &#x8FD8;&#x771F;&#x4FBF;&#x5B9C;&#xFF0C;&#x5C31;&#x662F;&#x6BD4;&#x8F83;&#x6298;&#x817E;&#x4E00;&#x70B9;&#xFF1B;</p>
<p><strong>Shadowsocks</strong>  </p>
<p>&#x7B80;&#x5355;&#x8BF4;&#xFF0C;Shadowsocks &#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#x7684;&#x4E00;&#x79CD;&#x534F;&#x8BAE;&#xFF0C;&#x786E;&#x5207;&#x8BF4;&#x662F;&#x5DE5;&#x4F5C;&#x5728;&#x4F20;&#x8F93;&#x5C42;&#x7684;&#x6807;&#x51C6;&#x4EE3;&#x7406;&#x534F;&#x8BAE;&#xFF0C;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;Socks5&#x4EE3;&#x7406;&#x65B9;&#x5F0F;&#x7684;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF1B;&#x4E5F;&#x88AB;&#x7B80;&#x79F0;&#x4E3A; ss&#x3002;</p>
<p>&#x5728; VPS &#x4E0A;&#x5B89;&#x88C5; ss &#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5E76;&#x4E14;&#x7F51;&#x4E0A;&#x7684;&#x6559;&#x7A0B;&#x5DF2;&#x7ECF;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x63A8;&#x8350; <a href="https://medium.com/@zoomyale/%E7%A7%91%E5%AD%A6%E4%B8%8A%E7%BD%91%E7%9A%84%E7%BB%88%E6%9E%81%E5%A7%BF%E5%8A%BF-%E5%9C%A8-vultr-vps-%E4%B8%8A%E6%90%AD%E5%BB%BA-shadowsocks-fd57c807d97e" target="_blank">Medium &#x7684;&#x8FD9;&#x7BC7;&#x6559;&#x7A0B;</a>&#x3002;&#x4EE5;&#x53CA;&#x67E5;&#x9605; <a href="https://github.com/shadowsocks" target="_blank">shadowsocks &#x5728; Github &#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;</a>&#x3002;</p>
<p><strong>Mac &#x5BA2;&#x6237;&#x7AEF;&#x914D;&#x7F6E;</strong>  </p>
<p>VPS &#x4E0A;&#x5B89;&#x88C5;&#x597D; ss &#x540E;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#xFF1A;</p>
<p><img src="http://img.xiaobotalk.cn/macSkills/vps_03.png" alt="vpn&#x89E3;&#x91CA;" width="50%"></p>

<p>&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x7684;&#x4EE3;&#x7406;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x914D;&#x7F6E;&#x5728; Mac &#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528; Shadowsocks NG &#x957F;&#x76F8;&#x662F;&#x7EB8;&#x98DE;&#x673A;&#x8F6F;&#x4EF6;&#xFF1A;</p>
<p><img src="http://img.xiaobotalk.cn/macSkills/vps_06.png" alt="vpn&#x89E3;&#x91CA;" width="20%"></p>

<p>Shadowsocks NG &#x662F;&#x901A;&#x8FC7; Github release &#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x662F; Shadowsocks &#x7684;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;<a href="https://github.com/shadowsocks/ShadowsocksX-NG/releases" target="_blank">Github release &#x4E0B;&#x8F7D;&#x5730;&#x5740;</a>&#x3002;</p>
<p>&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x542F;&#x52A8;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#xFF1A;</p>
<p><img src="http://img.xiaobotalk.cn/macSkills/vps_04.png" alt="vpn&#x89E3;&#x91CA;" width="60%"></p>

<p><strong>&#x5728; iPhone &#x4E0A;&#x4F7F;&#x7528;</strong>  </p>
<p>&#x5728; iPhone &#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x91CC;&#x8FD8;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x914D;&#x7F6E; Shadowsocks &#x534F;&#x8BAE;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4E09;&#x65B9;&#x5E94;&#x7528;&#xFF0C;&#x4F8B;&#x5982; ShadowProxy&#x3001;Shadowrocket &#x7B49;&#x3002;&#x53EF;&#x60DC;&#x7684;&#x662F;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x90FD;&#x88AB;&#x548C;&#x8C10;&#x4E86;&#xFF0C;&#x56FD;&#x5185; App Store &#x90FD;&#x4E0B;&#x8F7D;&#x4E0D;&#x5230;&#xFF0C;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x8FDE; <a href="https://github.com/shadowsocks/shadowsocks-iOS" target="_blank">Shadowsocks &#x5728; Github &#x4E0A;&#x5F00;&#x6E90; iOS &#x9879;&#x76EE;&#x90FD;&#x88AB;&#x5220;&#x9664;&#x4E86;</a>&#x3002;&#x76EE;&#x524D;&#x6709;&#x4E00;&#x6B3E; SuperRocket - SSR &#x5728; App Store 6&#x5143; &#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x8BD5;&#x8FC7;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x901A;&#x8FC7;&#x5728; Mac &#x4E0A;&#x5B89;&#x88C5; <a href="https://pro.25pp.com/" target="_blank">PP &#x52A9;&#x624B;</a> &#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D; Shadowrocket &#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#xFF1A;</p>
<p><img src="http://img.xiaobotalk.cn/macSkills/vps_05.png" alt="vpn&#x89E3;&#x91CA;" width="70%"></p>

<p>&#x4EB2;&#x6D4B;&#x53EF;&#x7528; (2018&#x5E74;/12&#x6708;)&#xFF1B;&#x5B89;&#x88C5;&#x540E;&#x6309;&#x7167;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x4F9D;&#x6B21;&#x586B;&#x5199;&#xFF0C;&#x7136;&#x540E; iPhone &#x5C31;&#x53EF;&#x4EE5;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#x4E86;&#x3002;</p>
<p>(&#x5B8C;)</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> By <a href="https://www.xiaobotalk.com" target="_blank">xiaobotalk</a> &#x6B22;&#x8FCE;&#x8BBF;&#x95EE;&#x6211;&#x7684;<a href="https://www.xiaobotalk.com" target="_blank">&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> &#x6B64;&#x9875;&#x9762;&#x4FEE;&#x8BA2;&#x4E8E;&#xFF1A; 2018-12-13 15:08:39 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="two_chrome_plugins.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 2.4. Chrome 插件推荐">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.5. 云服务简介与科学上网","level":"2.1.6","depth":2,"next":{"title":"三: Mac 进阶和程序员折腾篇","level":"3.1","depth":1,"ref":"","articles":[{"title":"3.1. Mac Terminal 相关配置","level":"3.1.1","depth":2,"path":"PartThree/three_mac_terminal.md","ref":"PartThree/three_mac_terminal.md","articles":[]},{"title":"3.2. Shell 常用指令与 Mac 特有的命令","level":"3.1.2","depth":2,"path":"PartThree/three_mac_shell.md","ref":"PartThree/three_mac_shell.md","articles":[]},{"title":"3.3. Charles 抓取网络请求","level":"3.1.3","depth":2,"path":"PartThree/three_mac_charles.md","ref":"PartThree/three_mac_charles.md","articles":[]},{"title":"3.4. 轻度编程从 Git 开始","level":"3.1.4","depth":2,"path":"PartThree/three_mac_git.md","ref":"PartThree/three_mac_git.md","articles":[]}]},"previous":{"title":"2.4. Chrome 插件推荐","level":"2.1.5","depth":2,"path":"PartTwo/two_chrome_plugins.md","ref":"PartTwo/two_chrome_plugins.md","articles":[]},"dir":"ltr"},"config":{"plugins":["disqus","donate","-sharing","sharing-plus","changyan","page-footer-ex","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"discuss"},"livereload":{},"page-footer-ex":{"copyright":"By [xiaobotalk](https://www.xiaobotalk.com) 欢迎访问我的[个人网站](https://www.xiaobotalk.com)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"此页面修订于："},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"donate":{"alipay":"/assets/alipay.png","alipayText":"支付宝打赏我","button":"打赏","title":" ","wechat":"/assets/weixinpay.png","wechatText":"微信打赏我"},"changyan":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"qq":true,"all":["facebook","google","twitter","weibo","qq","linkedin","qzone","douban"],"douban":false,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"Title":"Mac 使用技巧","links":{"sidebar":{"我的个人网站":"https://www.xiaobotalk.com"}},"gitbook":"*","languiage":"zh-hans"},"file":{"path":"PartTwo/Two_science_internet.md","mtime":"2018-12-13T07:08:39.664Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-17T04:30:09.092Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-changyan/changyan.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

